about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>About the Website</title>
<!-- 2016-01-16 Sat 09:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">About the Website</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">About this website</a></li>
<li><a href="#sec-2">About me</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">About this website</h2>
<div class="outline-text-2" id="text-1">
<p>
My goal as a developer has always been to keep learning. I spend a
lot of time tinkering with new languages and frameworks and not
enough time sharing my experiences and knowledge. I wanted an easy
way to integrate my sharing and learning with my work as a freelance
developer. My time as a freelance developer appears to be coming to
an end, but that is not going to stop me from continuing to learn
and share.
</p>

<p>
Being a big fan of emacs, in particular the marvelous org-mode
package, I wanted to use this as a basis for a solution that would
enable rapid sharing of my thoughts, ideas and experience.
</p>

<p>
This page is dedicated to my thought process and the solution I am
evolving to meet this need.
</p>

<p>
The website theme is based on the solarized css from <a href="http://thomasf.github.io/solarized-css/">Thomas Frossman</a>, itself
based on the solarized colour scheme from <a href="http://ethanschoonover.com/solarized">Ethan Schoonover</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">About me</h2>
<div class="outline-text-2" id="text-2">
<p>
My name is John Cumming, I live in Gloucester with my wife and son
and have been working as a software engineer since 1997. I enjoy
cycling, mountaineering, music, art and support the greatest rugby
team in the world, Gloucester Rugby.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-01-16 Sat 09:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
